ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32_WordClockV200/ESP32_WordClockV200.ino
//------------------------------------------------------------------------------              //
// CLOCK initialysations
//--------------------------------------------                                 
static uint32_t msTick;                                                                       // Number of millisecond ticks since we last incremented the second counter
byte      lastminute = 0, lasthour = 0, lastday = 0, sayhour = 0;
bool      Demo                 = false;
bool      FireDisplay          = false;
bool      Zelftest             = false;
bool      Is                   = true;                                                        // Toggle of displaying Is or Was
struct    tm timeinfo;                                                                        // storage of time 
//--------------------------------------------                                                //
// BLE  RX-TX //#include <NimBLEDevice.h>
//--------------------------------------------
static NimBLEServer *pServer      = NULL;
static NimBLECharacteristic * pTxCharacteristic;
static bool BLEConnected    = false;
static bool oldBLEConnected = false;
std::string ReceivedMessageBLE = "";
unsigned long BLEConnectedSince = 0;

#define SERVICE_UUID           "6E400001-B5A3-F393-E0A9-E50E24DCCA9E"                         // UART service UUID
#define CHARACTERISTIC_UUID_RX "6E400002-B5A3-F393-E0A9-E50E24DCCA9E"
#define CHARACTERISTIC_UUID_TX "6E400003-B5A3-F393-E0A9-E50E24DCCA9E"

//--------------------------------------------                                                //
// BLE TimeReceiver  //#include <NimBLEDevice.h>
//--------------------------------------------
 #define TIMESENDER_DEVICE_NAME "BLE-UARTtime"
 #define TIMERECEIVER_MIN_RSSI    (-90)

static NimBLEClient*               pClient        = nullptr;
static NimBLERemoteCharacteristic* pRemoteTX      = nullptr;
static NimBLERemoteCharacteristic* pRemoteRX      = nullptr;

// Found address and flags
static NimBLEAddress TRfoundAddr;
static bool          TRhaveFoundAddr      = false;
static bool          TRconnectRequested   = false;
static bool          TRConnecting         = false;
static bool          TRConnected          = false;
static unsigned long TRconnectStartms     = 0;
static unsigned long LastTimeReceiverScan = 0;
static bool          TimeReceiverRunning  = false; 
static const unsigned long CONNECT_TIMEOUT_MS = 10000;                         // 10s

//------------------------------------------------------------------------------              //
// WIFI and webserver
//----------------------------------------
#define NOT_SET       0
#define SET           1
#define SET_AND_OK    2
#define IN_AP_NOT_SET 3
#include "Webpage.h"                                                                          // The Clock web page
#include "SoftAP.h"                                                                           // The web page to enter SSID and password of the WIFI router 
#include "OTAhtml.h"                                                                          // OTA update page
#include "LogViewer.h"
WiFiEventId_t wifiEventHandler;                                                               // To stop the interrupts or callbacks triggered by WiFi.onEvent(WiFiEvent);, you need to deregister the event handler.
bool WIFIwasConnected       = false;                                                          // Is WIFI connected?
bool InApMode               = false;
volatile bool ntpJustSynced = false;
const char* AP_SSID         = "StartWordclock";
const char* AP_PASSWORD     = "wordclock";
AsyncWebServer server(80);
DNSServer dnsServer;
bool shouldReboot           = false;
bool OptionYRainbow         = false;
bool DoNotLog               = false;                                                          // Use this flag to suspress Logging to Logviewer 
byte NoConnectionCounter    = 0;                                                              // Count times minutes with no WIFI connection
String PendingCommand = "";
//----------------------------------------                                                    //
// WPS
//----------------------------------------
#define ESP_WPS_MODE      WPS_TYPE_PBC
#define ESP_MANUFACTURER  "ESPRESSIF"
#define ESP_MODEL_NUMBER  "ESP32"
#define ESP_MODEL_NAME    "ESPRESSIF IOT"
#define ESP_DEVICE_NAME   "ESP STATION"
static esp_wps_config_t config;

//----------------------------------------                                                    //
// Ring Buffer Logger
// circular Log buffer variables
//----------------------------------------
char*  LogBuffer      = nullptr;                                                              // Circular buffer
size_t LogBufferSize  = 0;                                                                    // Total buffer size
size_t LogWritePos    = 0;                                                                    // Write pointer
size_t LogStartPos    = 0;                                                                    // Startpos Write pointer
bool   LogWrapped     = false;                                                                // Did we wrap?

//------------------------------------------------------------------------------              //
// Common
//----------------------------------------
char      sptext[255];                                                                        // For common print use 
bool      LEDsAreOff        = false;                                                          // If true LEDs are off except time display
bool      NoTextInLeds      = false;                                                          // Flag to control printing of the text in function ColorLeds()
int       Previous_LDR_read = 512;                                                            // The actual reading from the LDR + 4x this value /5
uint16_t  MilliSecondValue  = 10;                                                             // The duration of a second  minus 1 ms. Used in Demo mode
uint32_t  Loopcounter       = 100;                                                            // ESP will restart if <10. so start with a larger start value

struct    EEPROMstorage {                                                                     // Data storage in EEPROM to maintain them after power loss
  byte DisplayChoice    = 0;
  byte TurnOffLEDsAtHH  = 0;
  byte TurnOnLEDsAtHH   = 0;
  byte LanguageChoice   = 0;
  byte LightReducer     = 50;
  int  LowerBrightness  = 0;
  int  UpperBrightness  = 255;                                                                // 
  int  NVRAMmem[24];                                                                          // LDR or other readings
  byte BLEOn            = 1;                                                                  // BLE On/Off
  byte NTPOn            = 1;                                                                  // NTP On/Off
  byte WIFIOn           = 1;                                                                  // WIFI  On/Off  
  byte StatusLEDOn      = 1;                                                                  // Status LEDs on board  On/Off
  byte MCUrestarted     = 0;                                                                  // No of times WIFI reconnected 
  byte LoopRebooted     = 0;                                                                  // No of times WIFI rebooted
  byte TimeReceiver     = 0;                                                                  // Use Time Sender app to set time 
  byte TimeLogPrint     = 0;                                                                  // Print time per minute (1) or hour (2)  
  byte DCF77On          = 0;                                                                  // Not used 
  byte UseRotary        = 0;                                                                  // Use coding for Rotary encoder ==1 or 3x1 membrane keypad ==2
  byte UseDS3231        = 0;                                                                  // Use the DS3231 time module 
  byte LEDstrip         = 0;                                                                  // 0 = SK6812 LED strip. 1 = WS2812 LED strip
  byte FiboChrono       = 0;                                                                  // true = Fibonacci, false = chrono clock display
  byte NoExUl           = 0;                                                                  // 0 = Normal, 1 = Extreme, 2 = Ultimate display of colours
  int  WIFIcredentials  = 0;                                                                  // Status of the WIFI connection. SSID&PWD set or in AP mode
  int  IntFuture2       = 0;                                                                  // For future use
  byte TimeSender       = 0;                                                                  // Turn this device on as time sender Code in ESP32Communications.ino sketch
  byte Ringbufcnt       = 0;                                                                  // Ringbuffer counter ON or OFF
  byte byteFuture3      = 0;                                                                  // For future use
  byte byteFuture4      = 0;                                                                  // For future use
  byte HetIsWasOff      = 0;                                                                  // Turn On or Off HET IS WAS   
  byte EdSoftLEDSOn     = 0;                                                                  // EdSoft text on/off   
  byte RandomDisplay    = 0;                                                                  // Choose every minute/hour another display 
  byte WIFInoConnection = 0;                                                                  // Will store the no of reboots   
  byte UseBLELongString = 0;                                                                  // Send strings longer than 20 bytes per message. Possible in IOS app BLEserial Pro 
  uint32_t OwnColour    = 0;                                                                  // Self defined colour for clock display
  uint32_t DimmedLetter = 0;
  uint32_t BackGround   = 0;
  char SSID[30];                                                                              // 
  char Password[40];                                                                          // 
  char BLEbroadcastName[30];                                                                  // Name of the BLE beacon
  char Timezone[50];
  int  Checksum        = 0;
}  Mem; 

//--------------------------------------------                                                //
// Menu
//0        1         2         3         4
//1234567890123456789012345678901234567890----  
bool ShortMenu = true;                                                                   // Small=true of full=false menu
const char *menu[] = {
 "A SSID, B Password, C BLE beacon name",
 "D Date (D15012021), T Time (T132145)",
 "E Timezone (E<-02>2 or E<+01>-1)",
 "F Own, V BKGD color (Fwwrrggbb Fwrgb)",
 "G Scan WIFI networks",
 "H H01 rotary H02 buttons H03/04 remote",
 "} Learn IR remote, + Fast BLE",  
 "I Info menu, II long menu",
 "J DS3231 RTC, H05 Time receiver On/Off",
 "K LDR /s, Time K1/min K2/hr K0/Off", 
 "N Display off between Nhhhh (N2208)",
 "O Display On/Off, P StatusLED On/Off", 
 "Q Display choice (Q0-9), ~ Changing",
 "R Reset settings,  @ Restart",
 "S Slope, L Min, M Max (S50 L5 M200)",
 "Unnn Demo (U200 msec), Y LED test",
 ") HETISWAS  On/Off, ( EdSoft On/Off",
 "#nnn Selftest,  RTC: ! See, & Update",
 "W WIFI, X NTP, Z WPS, CCC BLE",
 "Ed Nieuwenhuijs Mar 2026" };
 
