ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32_WordClockV200/ESP32_WordClockV200.ino
    case 'G':                                                                                 // Scan WIFI stations
      if(len == 1) 
       {
        CheckforWIFINetwork(true);
        if(WIFIwasConnected) WiFi.reconnect();
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter G ****");
      break;

    case 'H':                                                                                 // Use rotary encoder
      if(len == 3) 
       {
        byte Choice = (byte)SConstrainInt(InputString, 2, 0, 5);                              // keep the range between 0 and 5; H00 - H05
        if (Choice <5) Mem.UseRotary = Choice;
        else
            {
            if (Choice ==5) Mem.TimeReceiver = 1 - Mem.TimeReceiver;
            }
        if(Mem.UseRotary > 4) Mem.UseRotary = 0;
        Tekstprintln("*** Restart with @ to activate Rotary, key pad, Time sender app or IR remote ***");    // 
        if(Mem.UseRotary > 0)  {Mem.NTPOn = 0;              Mem.UseDS3231 = 1;}              // Configure related settings based on rotary use 
        else                   {Mem.WIFIOn = Mem.NTPOn = 1; Mem.UseDS3231 = 0;}
        } 
      else Tekstprintln("Error **** Enter H00 (none), H01=Rotary, H02=Membrane, H03 large IR-remote, H04 tiny IR-remote, H05 Time sender app ****");
      sprintf(sptext, "\n Use of rotary encoder is %s\n"
                        "         Use of keypad is %s\n"
                        "Use of large IR-remote is %s\n"
                        " Use of tiny IR-remote is %s\n"
                        "Use of Time sender app is %s",                        
                        Mem.UseRotary == 1 ? "ON" : "OFF", Mem.UseRotary == 2 ? "ON" : "OFF",
                        Mem.UseRotary == 3 ? "ON" : "OFF", Mem.UseRotary == 4 ? "ON" : "OFF",
                        Mem.TimeReceiver   ? "ON" : "OFF");
      Tekstprintln(sptext);      
      sprintf(sptext, "Use DS3231 is %s, WIFI is %s, NTP is %s\n *** Restart clock with @ ***", 
                       Mem.UseDS3231 ? "ON" : "OFF", Mem.WIFIOn ? "ON" : "OFF", Mem.NTPOn ? "ON" : "OFF");     
      if(Mem.UseRotary >2) { while(IrReceiver.decode())  IrReceiver.resume();  }              // Clear all pending commands    
      break;

    case 'I':                                                                                 // Menu
      if(InputString.equalsIgnoreCase("I"))  ShortMenu=true;
      if(InputString.equalsIgnoreCase("II")) ShortMenu=false;
      SWversion(ShortMenu);                                                                   // ShortMenu is true for small menu, false for full menu
      break;
      
    case 'J':                                                                                 // Use DS3231 RTC module
      if(len == 1) 
      {
        Mem.UseDS3231 =  1 - Mem.UseDS3231;
        Mem.NTPOn     = (1 - Mem.UseDS3231);
        if(Mem.WIFIOn == 0) Mem.NTPOn = 0;                                                    // If WIFI is Off then No NTP
        snprintf(sptext, sizeof(sptext), "Use DS3231 is %s, WIFI is %s, NTP is %s", 
                Mem.UseDS3231 ? "ON" : "OFF", Mem.WIFIOn ? "ON" : "OFF", Mem.NTPOn ? "ON" : "OFF");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter J ****");
      break;
      
    case 'K':  
      snprintf(sptext, sizeof(sptext), "K Test LDR, Print timestamp. K0=Off, K1=per min, K2 is per hour");
      if (len == 1)
        {                                                                                     // Test LDR
         TestLDR = 1 - TestLDR;
         snprintf(sptext, sizeof(sptext), "TestLDR: %s", TestLDR ? "On\n   Bits, Out, loops per second and time" : "Off\n");
        }
       if(InputString.equalsIgnoreCase("K0"))                                                 // do not log
        {
         Mem.TimeLogPrint = 0;
         snprintf(sptext, sizeof(sptext), "Time display per minute and hour is: %s", Mem.TimeLogPrint ? "ON\n" : "OFF\n");  
        } 
       if(InputString.equalsIgnoreCase("K1"))                                                 // Log per minute
        {
         Mem.TimeLogPrint = 1;
         snprintf(sptext, sizeof(sptext), "Time display per minute is: %s", Mem.TimeLogPrint ? "ON\n" : "OFF\n");  
        } 
       if(InputString.equalsIgnoreCase("K2"))                                                 // Log per hour
        {
         Mem.TimeLogPrint = 2;
         snprintf(sptext, sizeof(sptext), "Time display per hour is: %s", Mem.TimeLogPrint ? "ON\n" : "OFF\n");  
        }       
      break;
      
    case 'L':                                                                                 // Lower brightness
      if(len > 1 && len < 5) 
       {
        Mem.LowerBrightness = (byte)SConstrainInt(InputString, 1, 0, 250);
        snprintf(sptext, sizeof(sptext), "Lower brightness: %d bits", Mem.LowerBrightness);
       } 
      else snprintf(sptext, sizeof(sptext), "**** Input fault. \nEnter Lnnn where n between 1 and 250");
      break;
      
    case 'M':                                                                                 // Max brightness
      if(len > 1 && len < 5) 
       {
        Mem.UpperBrightness = SConstrainInt(InputString, 1, 1, 255);
        snprintf(sptext, sizeof(sptext), "Upper brightness changed to: %d bits", Mem.UpperBrightness);
       } 
      else snprintf(sptext, sizeof(sptext), "**** Input fault. \nEnter Mnnn where n between 1 and 255");
      break;
      
    case 'N':                                                                                 // Turn off display between hours
      snprintf(sptext, sizeof(sptext), "**** Length fault N. ****");
      if(len == 1) { Mem.TurnOffLEDsAtHH = Mem.TurnOnLEDsAtHH = 0;  } 
      else if(len == 5) 
       {
        Mem.TurnOffLEDsAtHH = (byte)InputString.substring(1, 3).toInt();
        Mem.TurnOnLEDsAtHH  = (byte)InputString.substring(3, 5).toInt();
       }
      Mem.TurnOffLEDsAtHH = _min(Mem.TurnOffLEDsAtHH, 23);
      Mem.TurnOnLEDsAtHH  = _min(Mem.TurnOnLEDsAtHH, 23);
      snprintf(sptext, sizeof(sptext), "Display is OFF between %2d:00 and %2d:00", Mem.TurnOffLEDsAtHH, Mem.TurnOnLEDsAtHH);
      break;
      
    case 'O':                                                                                 // Turn On/Off Display
      if(len == 1) 
       {
        LEDsAreOff = !LEDsAreOff;
        snprintf(sptext, sizeof(sptext), "Display is %s", LEDsAreOff ? "OFF" : "ON");
        if(LEDsAreOff) { ClearScreen(); }
        else 
         {
          Tekstprintln(sptext);
          EveryMinuteUpdate();
          sptext[0]=0;                                                                        // Suppress a second print of sptext
         }
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault O. ****");
      break;
      
    case 'P':                                                                                 // Status LEDs On/Off
      if(len == 1) 
        {
         Mem.StatusLEDOn = !Mem.StatusLEDOn;
         UpdateStatusLEDs(0);
         snprintf(sptext, sizeof(sptext), "StatusLEDs are %s", Mem.StatusLEDOn ? "ON" : "OFF");
        } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault P. ****");
      break;
      
    case 'Q':                                                                                 // Display choice
      if(len == 1)                                                                            // Print display options menu   
       {
        Tekstprintln("  Q0= Default yellow colour");
        Tekstprintln("  Q1= Hourly colour");
        Tekstprintln("  Q2= All white");
        Tekstprintln("  Q3= All Own colour");
        Tekstprintln("  Q4= Own colour, HETISWAS changing");
        Tekstprintln("  Q5= Wheel colour");
        Tekstprintln("  Q6= Digital display");
        Tekstprintln("  Q7= Hourly colour, HETISWAS changing");        
        Tekstprintln("  Q8= Rainbow colour");
        if (Mem.RandomDisplay) Tekstprintln("Random Display changing in ON\nChoose a display to stop it");
        Tekstprintln("In menu: ~1 or ~ is changing per minute, ~2 changing per hour.");
        sptext[0] = 0;                                                                        // Suppress a second print of sptext
       } 
      else 
      {
       byte dp = (byte)InputString.substring(1, 2).toInt();
       if(dp>LASTITEM) dp=0;
       Mem.DisplayChoice = dp;
       PrintDisplayChoice(); 
       sptext[0] = 0;                                                                         // Suppress a second print of sptext
       Mem.RandomDisplay = 0;                                                                 // turn Off random changing display
      }
      break;
      
